def slope_function():
    # Take input from user
    x1 = float(input("กรุณาใส่ตัวเลขแทนค่าใน X1: "))
    y1 = float(input("กรุณาใส่ตัวเลขแทนค่าใน Y1: "))
    x2 = float(input("กรุณาใส่ตัวเลขแทนค่าใน X2: "))
    y2 = float(input("กรุณาใส่ตัวเลขแทนค่าใน Y2: "))
    
    if x2 - x1 == 0:
        print("ไม่สามารถคำนวณสโลปได้เนื่องจาก x1 เท่ากับ x2")
        return
    
    M = (y2 - y1) / (x2 - x1)
    
    print(f"ค่า M (Slope) คือ: {M}")
    
    if M == 0:
        print(M, "เนื่องจาก M มีค่าเท่ากับ 0 ดังนั้นจึงเป็นเส้นขนาน")
    elif M == -1:
        print(M, "เนื่องจาก M มีค่าเท่ากับ -1 ดังนั้นจึงเป็นมุมฉาก")
    elif M < -1:
        print(M, "เนื่องจาก M มีค่าน้อยกว่า -1 ดังนั้นจึงเป็นมุมป้าน")
    elif M > 1:
        print(M, "เนื่องจาก M มีค่ามากกว่า 1 ดังนั้นจึงเป็นมุมแหลม")

slope_function()